[
    {
        "name": "URBAN ARMOR GEAR UAG iPhone Xs Max [6.5-inch Screen] Monarch Feather-Light Rugged [Black] Military Drop Tested iPhone Case",
        "price": "$59.95",
        "ratings": {
            "5 star": "88%",
            "4 star": "2%",
            "3 star": "4%",
            "1 star": "6%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "I'm super glad I got this case. I have the Iphone Max. I was walking out of my house with both hands full /groceries and phone. ( A normal person would put their phone away in their purse and not attempt to carry 4 bags in each hand plus a index finger holding on to their phone, but I'm not normal) So it slipped out of my hand, the corner of the phone fell perfectly on the corner of a brick landscape edging, then bounced 4 feet sideways onto pavement. Phone did not have a scratch. I swear almost pooped my pants, cause i thought for sure it cracked... but was surprised to see it was perfectly fine... I've had my fair share of case purchases. I always buy the cheap $10 to $20 cases, but since I paid over $1,200 on an overpriced phone... whats another $60 on a possibly over priced case? .... I'm glad i bought it!",
                "review_posted_date": "01 Oct 2018",
                "review_header": "I dropped it (accident) / saved my phone",
                "review_rating": "5.0 ",
                "review_author": "Mziz"
            },
            {
                "review_comment_count": "",
                "review_text": "Arrived on time and fits my iPhone xs max perfectly. Rugged but not so oversized that it feels bulky. Easy to slip phone in and out of case for cleaning but is secure within the case.",
                "review_posted_date": "30 Sep 2018",
                "review_header": "Fits iPhone xs max perfectly",
                "review_rating": "5.0 ",
                "review_author": "Wade Dukes"
            },
            {
                "review_comment_count": "",
                "review_text": "I love this phone case especially while I’m doing stuff in the field or even just a work. I definitely recommend this case for anyone.",
                "review_posted_date": "29 Sep 2018",
                "review_header": "It fits perfect",
                "review_rating": "5.0 ",
                "review_author": "Morgan"
            },
            {
                "review_comment_count": "",
                "review_text": "UAG makes the best cases!",
                "review_posted_date": "03 Oct 2018",
                "review_header": "High quality cases by UAG",
                "review_rating": "5.0 ",
                "review_author": "Matt P"
            },
            {
                "review_comment_count": "",
                "review_text": "I ordered this case directly from UAG's website ~ I've been using UAG cases since my iPhone 4S and this time around is no different. This case actually really helps with grip on the XS Max and in my opinion looks better than the one I had for my 7 plus. Buttons feel amazing and clicky, and the black just looks great.",
                "review_posted_date": "02 Oct 2018",
                "review_header": "Great protective case as always",
                "review_rating": "5.0 ",
                "review_author": "la_ryu"
            },
            {
                "review_comment_count": "",
                "review_text": "Honestly, this is the case I now buy for any phone I get. Specifically, the UAG Monarch is the model. It will fit your cellphone perfectly, provide great protection and look great. It's screen protector friendly and has a great lip on the front if you put your phone face down on a surface. I just wish they would make more colors...it's either black or red, though now they have added a black carbon fiber.",
                "review_posted_date": "25 Sep 2018",
                "review_header": "Perfect Case!!",
                "review_rating": "5.0 ",
                "review_author": "Pinhead"
            },
            {
                "review_comment_count": "",
                "review_text": "I usually never buy products this expensive without reviews but I bit the bullet becsuse I trust UAG. This case perfectly fits the max without obscuring any speakers,ports or sensors. It’s perfect protection. In particular the back dual cameras have some protection from the case without obscuring them and as usual the case is raised in the front for shock absorption. I will continue purchasing from UAG for future cases",
                "review_posted_date": "22 Sep 2018",
                "review_header": "Impressive case for my impressive phone",
                "review_rating": "5.0 ",
                "review_author": "Zee"
            },
            {
                "review_comment_count": "",
                "review_text": "Case is a semi hard rubber. Feels like cheap neoprene.",
                "review_posted_date": "30 Sep 2018",
                "review_header": "Feels cheap!",
                "review_rating": "1.0 ",
                "review_author": "Amazon Customer"
            }
        ],
        "url": "http://www.amazon.com/dp/B07H5JNWTS"
    },
    {
        "name": "Apple iPhone 8 Plus 5.5\", 64 GB, Fully Unlocked, Gold",
        "ratings": {
            "5 star": "60%",
            "4 star": "9%",
            "2 star": "4%",
            "1 star": "27%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "It is LOCKED. I bought a UNLOCKED one and received a LOCKED one. Absolutely irresponsible.",
                "review_posted_date": "28 Feb 2018",
                "review_header": "One Star",
                "review_rating": "1.0 ",
                "review_author": "Yesenia Flores"
            },
            {
                "review_comment_count": "",
                "review_text": "This phone said its unlocked and its not! When you call to have someone help you half the time your on hold.",
                "review_posted_date": "21 Mar 2018",
                "review_header": "Dont buy phone from this company!!!",
                "review_rating": "1.0 ",
                "review_author": "arline delgado"
            },
            {
                "review_comment_count": "",
                "review_text": "The phone works perfectly, it did come unlocked, the only thing I was not satisfied with is that it didnt come with that thingy to open the sim compartment, I had to use one from other iphone. But, the phone worked perfecty and it just beautiful.",
                "review_posted_date": "21 Apr 2018",
                "review_header": "Where's the thing to open the sim compartment?",
                "review_rating": "5.0 ",
                "review_author": "Michelle"
            },
            {
                "review_comment_count": "",
                "review_text": "Big Rip off i got a imitation Chinese phone with a android system on it no good",
                "review_posted_date": "05 Jul 2018",
                "review_header": "... Chinese phone with a android system on it no good",
                "review_rating": "1.0 ",
                "review_author": "Branson"
            },
            {
                "review_comment_count": "",
                "review_text": "Complete fake phone!",
                "review_posted_date": "02 Jul 2018",
                "review_header": "One Star",
                "review_rating": "1.0 ",
                "review_author": "Emmanuel"
            },
            {
                "review_comment_count": "",
                "review_text": "Very good phone, came on perfect conditions and arrived fast. Perfect for those looking for a fast, good looking and with a good camera phone. Unlocked, works everywhere.",
                "review_posted_date": "21 Feb 2018",
                "review_header": "Works everywhere",
                "review_rating": "5.0 ",
                "review_author": "Daniel"
            },
            {
                "review_comment_count": "",
                "review_text": "It hasn’t worked in my country! Please I just want to have the invoice to get to the store so I can get another model!!",
                "review_posted_date": "25 Apr 2018",
                "review_header": "It hasn’t worked in my country! Please I just want to change it for a one that works, cab anybody answer",
                "review_rating": "1.0 ",
                "review_author": "Carlos"
            },
            {
                "review_comment_count": "",
                "review_text": "The phone was not a unlocked",
                "review_posted_date": "02 Apr 2018",
                "review_header": "One Star",
                "review_rating": "1.0 ",
                "review_author": "H. Ha"
            }
        ],
        "url": "http://www.amazon.com/dp/B075R9PX3V"
    },
    {
        "name": "Apple iPhone 8 4.7\", 64 GB, Fully Unlocked, Gold",
        "ratings": {
            "5 star": "56%",
            "4 star": "6%",
            "3 star": "3%",
            "1 star": "35%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "FAKE IPHONE! BE AWARE",
                "review_posted_date": "16 May 2018",
                "review_header": "One Star",
                "review_rating": "1.0 ",
                "review_author": "Eric Edwards"
            },
            {
                "review_comment_count": "",
                "review_text": "I loved my phone until it stopped working after two weeks will never order from this seller again",
                "review_posted_date": "06 Feb 2018",
                "review_header": "One Star",
                "review_rating": "1.0 ",
                "review_author": "Elaine"
            },
            {
                "review_comment_count": "",
                "review_text": "The product was brand new and authentic. However, the description says the phone is unlocked, but when I received the device, it was connected to the T-Mobile carrier",
                "review_posted_date": "09 Aug 2018",
                "review_header": "Authentic iPhone, but....",
                "review_rating": "1.0 ",
                "review_author": "Anastasia Williams"
            },
            {
                "review_comment_count": "",
                "review_text": "Ordered “Like New”, unlocked 256gb iPhone 8 from meow-tronics. Came without the original box, as described, with an original Apple charging block and cable. Phone had some barely noticeable wear on the corner of the screen, but is otherwise perfect. Worked fine when I transferred my SIM card from iPhone SE on MetroPCS. Definitely would recommend buying from this seller.",
                "review_posted_date": "05 Aug 2018",
                "review_header": "Worked perfectly.",
                "review_rating": "5.0 ",
                "review_author": "Derek L."
            },
            {
                "review_comment_count": "",
                "review_text": "He send me used iPhone 8 with generic charger I'm order new iPhone 8 with full price",
                "review_posted_date": "11 Aug 2018",
                "review_header": "He send me used phone",
                "review_rating": "1.0 ",
                "review_author": "Inas"
            },
            {
                "review_comment_count": "",
                "review_text": "I bought an iphone 8 that clearly says fully unlocked and I got a blocked phone, I am now out of the USA and I have tried to send the equipment and it has become impossible, I am not at all happy or satisfied, this purchase is a disaster, I can do?",
                "review_posted_date": "12 Sep 2018",
                "review_header": "I need unlock iPhone",
                "review_rating": "1.0 ",
                "review_author": "fernando araujo"
            },
            {
                "review_comment_count": "",
                "review_text": "Not buy here. The seller publish item like very new. And is refurbished and with problems in my case the charging battery. 100% fail",
                "review_posted_date": "05 Apr 2018",
                "review_header": "The seller publish item like very new",
                "review_rating": "1.0 ",
                "review_author": "Hernan Bermudez"
            },
            {
                "review_comment_count": "",
                "review_text": "great phone",
                "review_posted_date": "07 Jun 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            }
        ],
        "url": "http://www.amazon.com/dp/B075R93J59"
    },
    {
        "name": "Apple iPhone 7 Plus Unlocked Phone 32 GB - US Version (Black)",
        "ratings": {
            "5 star": "68%",
            "4 star": "8%",
            "3 star": "3%",
            "2 star": "2%",
            "1 star": "19%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "It had multiple issues and I took it to a mobile shop that determined it was fake! Being returned for refund. This was sold by Pure mobile.",
                "review_posted_date": "16 Feb 2017",
                "review_header": "Received a fake iphone",
                "review_rating": "1.0 ",
                "review_author": "Steven Spearman"
            },
            {
                "review_comment_count": "",
                "review_text": "THIS IS THE WORST!! I PAID $960 FOR AN IPHONE AND I RECEIVED A FAKE IPHONE, TOTALLY RETURNING THIS AND I WANT MY MONEY BACK!!!",
                "review_posted_date": "09 Feb 2017",
                "review_header": "IPHONE 7+ BY PUREMOBILE ARE FAKE DON'T BUY IT!!!",
                "review_rating": "1.0 ",
                "review_author": "Gabriela"
            },
            {
                "review_comment_count": "",
                "review_text": "Not trustable. I bought one and received a damaged- non working phone.",
                "review_posted_date": "11 May 2017",
                "review_header": "DONT BUY",
                "review_rating": "1.0 ",
                "review_author": "Brian larrañaga"
            },
            {
                "review_comment_count": "",
                "review_text": "If you can only use a phone with specific carriers, it is NOT UNLOCKED. This phone is NOT UNLOCKED. I could not put it on my Verizon service. The worker at the Verizon store explained to me that Apple made the 7 series specific to particular carriers, which must have upset many people, because the phones were changed back to unlockable with the 8 series. What's maybe even more upsetting to me is that because at a glance this seller/item has an overall very high rating (which must be due to fake reviews), I didn't look at the reviews before I bought the phone. And apparently Amazon does't look at the reviews, either, because there have been so many reviews with complaints that are similar to mine, and also complaints of receiving fake iPhones (that did not seem to be an issue with mine) , yet Amazon continues to allow the sale of this item with apparently multiple, false representations. That is reprehensible, and illegal.",
                "review_posted_date": "31 Aug 2018",
                "review_header": "THIS PHONE IS NOT UNLOCKED- FRAUDULENT ADVERTISING",
                "review_rating": "1.0 ",
                "review_author": "Lori Nevias"
            },
            {
                "review_comment_count": "",
                "review_text": "Great deal and fast shipping. iPhone is working perfectly in my country (UAE) no connectivity problems. The only problem with iPhone 7 is the hiss noise which is a general problem. Apple said it will replace your phone if you experience this problem.",
                "review_posted_date": "04 Jan 2017",
                "review_header": "Great deal",
                "review_rating": "5.0 ",
                "review_author": "BiMMER"
            },
            {
                "review_comment_count": "",
                "review_text": "The shipping was on time and the product's condition was phenomenal. I'am new to apple's ecosystem, I first purchased the iPad Pro 12.9 and fell in love with it so now I needed the latest and greatest. Right off the bat, the sheer speed and power of this phone is insane and the camera is the best I've seen on any phone. The only thing that bothers me is the battery charge time. It's a 3 hour charge compared to a 1 hour charge on my S7 edge.",
                "review_posted_date": "14 Mar 2017",
                "review_header": "9 and fell in love with it so now I needed the latest and ...",
                "review_rating": "5.0 ",
                "review_author": "Michael J Smith"
            },
            {
                "review_comment_count": "",
                "review_text": "Happy with my purchase, I was weary I was going to get a fake iPhone, but it is indeed real. It was delivered earlier than expected. And I'm writing this review from my new 7 plus.",
                "review_posted_date": "26 Nov 2016",
                "review_header": "Love my new iPhone , happy with my service.",
                "review_rating": "5.0 ",
                "review_author": "Tyler S"
            },
            {
                "review_comment_count": "",
                "review_text": "I got iphone 7plus last April..but were not able to open it not until the other day.It was clearly stated that it was unlocked. But then we found out it wasnt unlocked yet..Unfortunately we cant open the phone. Please let us know what to do. Thank you.",
                "review_posted_date": "25 May 2018",
                "review_header": "I got iphone 7plus last April.. but were ...",
                "review_rating": "1.0 ",
                "review_author": "Methl Rose Nillas"
            }
        ],
        "url": "http://www.amazon.com/dp/B073QMF6Z9"
    },
    {
        "name": "Apple iPhone X, GSM Unlocked 5.8\", 256 GB - Space Gray",
        "ratings": {
            "5 star": "60%",
            "4 star": "10%",
            "3 star": "4%",
            "2 star": "4%",
            "1 star": "22%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "Don't ever purchase from this vendor. The iPhone arrived with a non-functional power slot in it. It didn't even come close to fitting the power tip and appeared to be missing all electronic connections. This made the iPhone useless since it couldn't be charged. The box looked fake. It was especially devastating since we live in a remote area where we cannot get an iPhone elsewhere and had waited nearly 3 weeks for this to arrive. To realize you've been had this way is especially cruel.",
                "review_posted_date": "22 Feb 2018",
                "review_header": "iPhone didn't work at all",
                "review_rating": "1.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "Phone freezes a bit and I need to reboot but that is maybe once a week. I am hopeful that a future update will fix this. Annoying that it doesn't read my face properly when I am wearing my glasses. Not many apps are up to the speed with the facial scan so I need to type in my password every time I check my banking statements. The missing fingerprint button took some time getting used to but once I did, I don't even miss it. The camera is lovely as is the speed. I wish there were more color and size choices, but prob next year.",
                "review_posted_date": "31 May 2018",
                "review_header": "Beautiful phone, happy with the upgrade",
                "review_rating": "4.0 ",
                "review_author": "Ofelia P."
            },
            {
                "review_comment_count": "",
                "review_text": "Shipping arrive one time phone was brand new in a seal box",
                "review_posted_date": "04 Dec 2017",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "Xaymara melendez"
            },
            {
                "review_comment_count": "",
                "review_text": "Great phone. I love it. I need iphone for my business so im buying for show off. Works great and thats what i need. Thank u",
                "review_posted_date": "17 Dec 2017",
                "review_header": "Great phone. I love it",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "Number 1 problem, people can not hear me when I call them. Only when I use the speaker works. Unfortunately started after the 30-day return period. Now I'm stuck with a phone that had zero privacy.",
                "review_posted_date": "10 Aug 2018",
                "review_header": "problem",
                "review_rating": "2.0 ",
                "review_author": "billy"
            },
            {
                "review_comment_count": "",
                "review_text": "This was a fake phone",
                "review_posted_date": "04 Aug 2018",
                "review_header": "Do not buy",
                "review_rating": "1.0 ",
                "review_author": "Jennifer"
            },
            {
                "review_comment_count": "",
                "review_text": "Original iPhone X, it worked with my T-Mobile Chip perfectly, let's see how it goes overseas... It came with a used / dirty cable and USB box, didn't came with the headphone jack adapter, neither instructions nor original box",
                "review_posted_date": "01 Aug 2018",
                "review_header": "Original iPhone X",
                "review_rating": "5.0 ",
                "review_author": "Marcelo Abad C"
            },
            {
                "review_comment_count": "",
                "review_text": "brand new and unlocked ,all my fears where in vain.good product",
                "review_posted_date": "24 Jul 2018",
                "review_header": "good",
                "review_rating": "5.0 ",
                "review_author": "Peter"
            }
        ],
        "url": "http://www.amazon.com/dp/B075QMZH2L"
    }
]